app/Controllers/Home.php

	public function index()
	{
		$data= $this->data;
		$data["title"] = "Home";

		$compMdl = new ClassModel();
		$data['class'] = $compMdl->select("class.*")
			->groupBy("class.id")
			->get()->getResultArray();

		$instructorMdl = new InstructorModel();
        $data['instructor'] = $instructorMdl->select("intructor.*")
			->get()->getResultArray();
---
SELECT `class`.*
FROM `class`
GROUP BY `class`.`id`
SELECT `intructor`.*
FROM `intructor`

	public function admin()
	{
		$data = $this->data;
		$data["title"] = "Dashboard";
		$eventMdl = new EventModel();
		$classMdl = new ClassModel();
		$instructorMdl = new InstructorModel();
		$clientMdl = new ClientModel();
		$data["num_event"] = $eventMdl->selectCount("id")->countAllResults();
		$data["num_class"] = $classMdl->selectCount("id")->countAllResults();
		$data["num_results"] = $instructorMdl->selectCount("id")->countAllResults();
		$data["num_client"] = $clientMdl->selectCount("id")->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `event`
SELECT COUNT(*) AS `numrows`
FROM `class`
SELECT COUNT(*) AS `numrows`
FROM `client`

	public function add_class()
	{
		$data = $this->data;
		$data["title"] = "Add New Class";
		$data["subtitle"] = "Add New Class";
		$classMdl = new ClassModel();
		$postMdl = new PostModel();
		$instMdl = new InstructorModel();
		$data['class'] = $instMdl->select("intructor.*")
			->orderBy("id", "DESC")
			->get()->getResultArray();

		$data['classes'] = $classMdl->select("class.*")
			->orderBy("id", "DESC")
			->get()->getResultArray();

		$data['post'] = $postMdl->select("post.*")
			->orderBy("id", "DESC")
			->get()->getResultArray();
---
SELECT `intructor`.*
FROM `intructor`
ORDER BY `id` DESC
SELECT `class`.*
FROM `class`
ORDER BY `id` DESC
SELECT `post`.*
FROM `post`
ORDER BY `id` DESC

	public function add_schedule()
	{
		$data = $this->data;
		$data["title"] = "Add New Schedule";
		$data["subtitle"] = "Add New Class";
		$classMdl = new ClassModel();
		$postMdl = new ScheduleModel();
		$instMdl = new InstructorModel();
		$data['instructor'] = $instMdl->select("intructor.*")
			->orderBy("id", "DESC")
			->get()->getResultArray();

		$data['class'] = $classMdl->select("class.*")
			->orderBy("id", "DESC")
			->get()->getResultArray();

		$data['schedule'] = $postMdl->select("schedule.*")
			->orderBy("id", "DESC")
			->get(5)->getResultArray();
---
SELECT `intructor`.*
FROM `intructor`
ORDER BY `id` DESC
SELECT `class`.*
FROM `class`
ORDER BY `id` DESC
SELECT `schedule`.*
FROM `schedule`
ORDER BY `id` DESC
 LIMIT 5

	public function add_client()
	{
		$data = $this->data;
		$data["title"] = "Add New Client";
		$data["subtitle"] = "Add New Class";
		$classMdl = new ClassModel();
		$clientMdl = new ClientModel();
		$instMdl = new InstructorModel();
		$data['client'] = $clientMdl->select("client.*")
			->orderBy("id", "DESC")
			->get()->getResultArray();
---
SELECT `client`.*
FROM `client`
ORDER BY `id` DESC

	public function add_instructor()
	{
		$data = $this->data;
		$data["title"] = "Add New Instructor";
		$data["subtitle"] = "Add New Class";

		$instMdl = new InstructorModel();
		$postMdl = new PostModel();
		$classMdl = new ClassModel();
		$data['instructor'] = $instMdl->select("intructor.*")
			->orderBy("id", "DESC")
			->get()->getResultArray();

		$data['post'] = $postMdl->select("post.*")
			->orderBy("id", "DESC")
			->get()->getResultArray();
		$data['class'] = $classMdl->select("class.*")
			->orderBy("id", "DESC")
			->get()->getResultArray();
---
SELECT `intructor`.*
FROM `intructor`
ORDER BY `id` DESC
SELECT `post`.*
FROM `post`
ORDER BY `id` DESC
SELECT `class`.*
FROM `class`
ORDER BY `id` DESC